; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph2 - mode
	infrared1 - mode
	infrared3 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation9 - direction
	Star1 - direction
	GroundStation8 - direction
	Star7 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 infrared3)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation9)
)
(:goal (and
	(pointing satellite1 Phenomenon11)
	(have_image Planet10 infrared1)
	(have_image Phenomenon11 infrared1)
	(have_image Star12 infrared3)
	(have_image Planet13 spectrograph0)
	(have_image Planet14 spectrograph2)
	(have_image Phenomenon15 spectrograph0)
	(have_image Planet16 infrared1)
))

)

; plan
1. (turn_to satellite1 groundstation6 groundstation9)
   deleted: (pointing satellite1 groundstation9)
   added: (pointing satellite1 groundstation6)
   goals met: 0 of 8
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite1 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite1 planet14 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet14)
   goals met: 0 of 8
5. (take_image satellite1 planet14 instrument1 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 phenomenon15)
   goals met: 1 of 8
7. (take_image satellite1 phenomenon15 instrument1 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 2 of 8
8. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 2 of 8
9. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 8
10. (turn_to satellite1 groundstation3 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 groundstation3)
   goals met: 2 of 8
11. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 2 of 8
12. (turn_to satellite1 planet10 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet10)
   goals met: 2 of 8
13. (take_image satellite1 planet10 instrument2 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 3 of 8
14. (turn_to satellite1 planet13 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet13)
   goals met: 3 of 8
15. (take_image satellite1 planet13 instrument2 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 4 of 8
16. (turn_to satellite1 planet16 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet16)
   goals met: 4 of 8
17. (take_image satellite1 planet16 instrument2 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 5 of 8
18. (turn_to satellite1 star12 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star12)
   goals met: 5 of 8
19. (take_image satellite1 star12 instrument2 infrared3)
   added: (have_image star12 infrared3)
   goals met: 6 of 8
20. (turn_to satellite1 phenomenon11 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 phenomenon11)
   goals met: 7 of 8
21. (take_image satellite1 phenomenon11 instrument2 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 8 of 8
